Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: For example, if a channel is proposed with a 'channel type' of "example_session@example.com" but fails, then the server will respond with either a 'reason code' assigned by the IANA (as listed above and in the range of 0x00000001 to 0xFDFFFFFF), or with a locally assigned value in the range of 0xFE000000 to 0xFEFFFFFF.
ja: たとえば,"example_session@example.com" という 'channel type' のチャンネルが提案されたが失敗したとき, サーバは(前述ないし0x00000001 から 0xFDFFFFFFの範囲の) IANA で割り当てられた 'reason code'を返すか, 0xFE000000 から 0xFEFFFFFF の埴のローカルに割り当てられた値を'reason code' を返す.

source: Family 1 only (min_LOS 128): kex_algorithm name_list := { ecdh_sha2_nistp256 } encryption_algorithm name_list := { AEAD_AES_128_GCM } mac_algorithm name_list := { AEAD_AES_128_GCM }
ja: ファミリー 1 のみ (min_LOS 128): kex_algorithm name_list := { ecdh_sha2_nistp256 } encryption_algorithm name_list := { AEAD_AES_128_GCM } mac_algorithm name_list := { AEAD_AES_128_GCM }

source: All packets exchanged during the re-exchange are encrypted and authenticated using the current keys until the conclusion of the re-exchange, at which point an SSH_MSG_NEWKEYS initiates a change to the newly established keys.
ja: 再交換で交換されるすべてのパケットは, 再交換が終わるまで現在の鍵を用いて暗号化され認証される. 再交換が終わると SSH_MSG_NEWKEYS が 新しく確立した鍵への変更を開始する.

source: It also MUST set integ_req_flag to "true" to request that per-message integrity protection be supported for this context.
ja: また, この文脈でメッセージ単位での完全性保護のサポートを要求するため, integ_req_flag も "true" に設定しなければならない.

source: Initial Assignment of Signal Names .................15 4.9.5.
ja: シグナル名の初期の割り当て.............15 4.9.5.

source: Authentication Protocol Support
ja: 認証プロトコルのサポート

source: This message is sent with the old keys and algorithms.
ja: このメッセージは, 古い鍵とアルゴリズムで送られる.

source: Structure of the MIB Module ...............................21 6.2.
ja: MIBモジュールの構造 ...............................21 6.2.

source: The Secure Shell Transport Model uses some of these conceptual data flows when communicating between subsystems.
ja: セキュアシェルトランスポートモデルは, サブシステム間の通信にこれらの概念的なデータフローのいくつかを利用する.

source: SSH Host Key Verification
ja: SSH ホスト鍵の検証

source: Since the new client MAY immediately send additional data after its identification string (before receiving the server's identification string), the old protocol may already be corrupt when the client learns that the server is old.
ja: 新しいクライアントは, 認証文字列のあとすぐに (サーバの認証文字列を受け取る前に) 追加のデータを送ってもよいので, クライアントがサーバが古いと知るときには古いプロトコルはすでに壊れていることがある.

source: Begin and End Markers
ja: 開始と終了のマーカー

source: If the last packet has been sent out to the network (i.e., the attacker has access to it), then he can use the attack.
ja: 最後のパケットがネットワークに送られる(すなわち攻撃者がアクセスできる)と, 攻撃者は攻撃を利用できる.

source: Essentially, this mode is theoretically vulnerable to chosen cipher-text attacks because of the high predictability of the start of packet sequence.
ja: 本来, このモードは, 選択暗号文攻撃に理論的に脆弱だ. パケット列の先頭が高い確率で予測できるからだ.

source: Additional session/connection state information might also be stored in a Local Configuration Datastore.
ja: 追加のセッション/接続状態の情報が ローカル設定データストアに保持されるかもしれない.

source: Do the following:
ja: 以下の手順を実行:

source: The hash H is formed by applying the algorithm HASH on a concatenation of the following:
ja: ハッシュ H は, 次の連結に対して HASH アルゴリズムを適用した結果だ:

source: Certificate extensions allow for the specification of additional attributes associated with a public key in an X.509v3 certificate (see Section 4.2 of [RFC5280]).
ja: 証明書の拡張で, X.509v3 証明書の公開鍵に関連する追加の属性を指定できる ([RFC5280] の 4.2 節を参照).

source: Allowed Non-Signature Algorithm Name Lists
ja: 受け入れられる署名以外アルゴリズムの name-list

source: "exec" specifies that session channel "exec" requests should be denied when this key is in use.
ja: "exec" は, この鍵を用いるとセッションチャンネルの "exec" 要求が拒否されることを指定する.

source: Command generators are frequently operated by a human, but notification originators are usually unmanned automated processes.
ja: コマンド生成器は人間によって頻繁に操作される. しかし, 通知の発信者は, 通常人手を介さない自動のプロセスだ.

source: The "Handbook of Applied Cryptography" [MENEZES] lists the following algorithm to generate a k-bit safe prime p.
ja: "Handbook of Applied Cryptography" [MENEZES] は, k-bitの安全な素数の生成のために次のアルゴリズムを示している.

source: The connection protocol [SSH-CONNECT] specifies a mechanism to multiplex multiple streams (channels) of data over the confidential and authenticated transport.
ja: コネクションプロトコル [SSH-CONNECT]は, 秘密で認証されたトランスポート上のデータの複数のストリームを多重化する メカニズムを定義する.

source: The required algorithms MAY depend on the location from where the user is trying to gain access.
ja: 要求されるアルゴリズムは, アクセスしようとするユーザの場所に依存してもよい.

source: This is not allowed in AES-GCM secure shell.
ja: これは AES-GCM セキュアシェルでは許可されない.

source: The "version" packet MUST NOT be sent again after this initial exchange.
ja: この "version" パケットは, 最初の交換の後で再び送ってはならない.

source: The version packet, as well as all requests and responses described in Section 4, are a description of the 'name' field and the data part of the packet.
ja: (3.4節で記述する)バージョンパケットと4節で記述する要求と応答では, 'name' フィールドとパケットのデータ部を記述している.

source: For example, local policy might allow a user to access files on the server, but not start an interactive shell.
ja: たとえば, ローカルなポリシーがユーザにサーバのファイルへのアクセスを許すがインタラクティブなシェルの開始は許さないとする.

source: Authentication Using GSS-API Key Exchange
ja: GSS-API 鍵交換を利用する認証

source: Configuration or state data may include sensitive information, such as usernames or security keys.
ja: 設定や状態のデータは, ユーザ名やセキュリティ鍵などの重要な情報を含む場合がある.

source: In the third man-in-the-middle case, attackers may attempt to manipulate packets in transit between peers after the session has been established.
ja: 3つ目のケースは, セッションが確立された後でピア間の通信のパケットを操作しようとするものだ.

source: Requests for assignments of new Channel Connection Failure 'reason code' values, and their associated Channel Connection Failure 'description string', in the range of 0x00000005 to 0xFDFFFFFF MUST be done through the IETF CONSENSUS method, as described in [RFC2434].
ja: チャンネル接続失敗の 'reason code' の値と関連するチャンネル接続失敗の 'description' を割り当てる要求は, 0x00000010 から 0xFDFFFFFF の範囲については [RFC2434] に記述されている IETF CONSENSUS によってされなければならない

source: In general, the ECMQV key exchange is performed using the ephemeral and long-term key pair of both the client and server, which is a total of 4 keys.
ja: 一般に, ECMQV 鍵交換はクライアントとサーバ両方で一時的な鍵と長期間の鍵を用いて行なわれる. すなわち 全部で4つの鍵を用いる.

source: ECDSA-384 only (min_LOS 128 or 192): server_host_key_algorithms name_list := { x509v3-ecdsa-sha2-nistp384 }
ja: ECDSA-384 のみ (min_LOS 128 or 192): server_host_key_algorithms name_list := { x509v3-ecdsa-sha2-nistp384 }

source: The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this document are to be interpreted as described in RFC 2119 [5].
ja: この文書でのキーワード "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", "OPTIONAL" は, RFC 2119 [5] で記述されているように解釈される.

source: Once the user has been successfully authenticated, the client will invoke the "ssh-connection" service, also known as the SSH connection protocol.
ja: ユーザが認証に成功したら, クライアントは SSHコネクションプロトコルとして知られている "ssh-connection" サービスを起動する.

source: The certificate sequence contained in the certificate blob can be used to provide authorization.
ja: 承認の提供が利用できるように, 証明書のシーケンスが, certificate blob に含まれる.

source: Proxy Forwarding ...................................24 9.5.3.
ja: ポート転送 ...................................24 9.5.3.

source: Session State ......................................14 5.
ja: セッション状態 ......................................14 5.

source: SSH [RFC4251] is a very common protocol for secure remote login on the Internet.
ja: SSH [RFC4251] は, インターネットでの安全なリモートログインのための非常に一般的なプロトコルだ.

source: The server MAY ignore the client 'user name', if it wants to authenticate only the client host.
ja: クライアントホストに対してだけ認証したい場合, サーバはクライアントの 'user name' を無視してもよい.

source: The submethods field is included so the user can give a hint of which actual methods he wants to use.
ja: submethods フィールドは, ユーザが利用したいと望む実際の方法のヒントが含まれる.

source: If this is a server-side SSH session and this is not the first message received over the session, then the tmTransportAddress is set to the previously established tmTransportAddress for the session (the value from step B, determined from a previous incoming message).
ja: サーバ側のSSHセッションで, セッションを介して受信したメッセージでなければ, セッションに以前設定した tmTransportAddress (ステップ Bからの値で, 以前受信したメッセージから決定されている) に tmTransportAddress は設定される.

source: Requests for assignments of new Names MUST be done through the IETF Consensus method as described in [11].
ja: 新しい名前の割り当ての要求は, [11] に記述されている IETF CONSENSUS によってされなければならない.

source: This value MUST be constant for the entire SSH session, and future messages received MUST result in the tmTransportAddress being set to the same value.
ja: この値は, 全体の SSH のセッションで定数でなければならない. 将来受信するメッセージは, tmTransportAddress が同じ値に設定されていなければならない.

source: In this case, one must either resort to pseudo-random number generation regardless of insufficient entropy or refuse to run the protocol.
ja: この場合, 不十分なエントロピー量でもあえて疑似乱数生成を行なうかプロトコルを終了するかのどちらかを選択しなければならない.

source: Note that the server may require additional authentications.
ja: サーバが, 追加の認証法を要求してもよいことを注記しておく.

source: Use of that configuration option without corresponding changes to firewall or network device configuration may unintentionally result in the ability for nodes outside the firewall or other administrative boundary to gain access to "netconf" SSH subsystem.
ja: ファイアウォールやネットワークデバイスの設定を対応して変更することなしにこの設定項目を利用すると, "netconf" SSH サブシステムへのアクセスを得ようとする ファイアウォールや他の管理境界の外にあるノードの接続に意図しない影響を与える可能性がある.

source: Security Considerations ........................................14 10.
ja: セキュリティの考慮 ........................................14 10.

source: comment defined in Section 3.3.2
ja: comment は 3.3.2 節で定義されている.

source: The following is an overview of the key exchange process:
ja: 鍵交換プロセスの概要を以下に示す.

source: Disclosure - SSH provides protection against the disclosure of information to unauthorized recipients or eavesdroppers by allowing for encryption of all traffic between SNMP engines.
ja: 開示 - SSH は SNMP エンジン間のすべての通信を暗号化することで, 権限のない受信者や盗聴者に対して情報を開示しないよう保護を提供する.

source: The overall security of using SSHFP for SSH host key verification is dependent on the security policies of the SSH host administrator and DNS zone administrator (in transferring the fingerprint), detailed aspects of how verification is done in the SSH implementation, and in the client's diligence in accessing the DNS in a secure manner.
ja: SSHのホスト鍵の検証に SSHFP を使う場合の総合的なセキュリティは, SSH のホスト管理者と (指紋を転送する) ＤＮＳ ゾーンの管理者のセキュリティポリシーや SSHの実装でどのように検証が行なわれるかの詳細, DNSに安全な方法でアクセスするクライアントの努力の詳細に依存している.

source: There is no solid estimate as to when this may occur, but it is widely believed to be at least 20 years from the present.)
ja: いつ達成されるかのしっかりした見積りはないが, 現在より少なくとも20年はかかると広く信じられている.)

source: System administrators and implementers should take careful consideration of the security issues when enabling curves other than the REQUIRED or RECOMMENDED curves in this document.
ja: システムの管理者と実装者は, この文書での必須や推奨でない曲線を有効にする際にセキュリティ問題について注意深く考察する必要がある.

source: o Integrity key server to client: HASH(K || H || "F" || session_id)
ja: o サーバからクライアントへの完全性のための(MACの)鍵: HASH(K || H || "F" || session_id)

source: Requests and Responses .
ja: 要求と応答 .

source: DESCRIPTION "The compliance statement for SNMP engines that support the SNMP-SSH-TM-MIB." MODULE MANDATORY-GROUPS { snmpSshtmGroup } ::= { snmpSshtmCompliances 1 }
ja: DESCRIPTION "SNMP-SSH-TM-MIB をサポートする SNMP エンジンとための準拠の宣言." MODULE MANDATORY-GROUPS { snmpSshtmGroup } ::= { snmpSshtmCompliances 1 }

source: The server sends response packets that indicate success or failure as well as provide specific response data.
ja: サーバは応答パケットを送信して, 成功か失敗を示し応答に特有のデータを提供する.

source: Upon receiving this message when initial key exchange was performed using a GSS-API-based key exchange method, the server uses GSS_VerifyMIC() to verify that the MIC received is valid.
ja: GSS-API ベースの鍵交換法を用いて最初の鍵交換が行なわれた場合にこのメッセージを受け取ったら, 受け取った MIC が正当化検証するために GSS_VerifyMIC() をサーバは利用する.

source: The "null" host key algorithm has no associated host key material and provides neither signature nor encryption algorithms.
ja: "null" ホスト鍵アルゴリズムは, 関連するホスト鍵素材を持たず, 署名や暗号化のアルゴリムを提供しない.

source: The sizes of these keys varies depending upon which cryptographic algorithms are being used.
ja: これらの鍵のサイズは, 利用される暗号アルゴリズムに依存して変わる.

source: Treatment of the Packet Length Field .......................8 8.
ja: Packet Length フィールドの扱い .......................8 8.

source: No implementation is required to send them.
ja: このメッセージを送ることは, どの実装にも要求されていない.

source: There are two relevant keyUsage identifiers for the certificate corresponding to the public key algorithm in use:
ja: 利用中の公開鍵アルゴリズムに対応する証明書への2つの関連する keyUsage 識別子がある:

source: The public key algorithms and encodings defined in this document SHOULD be accepted any place in the Secure Shell protocol suite where public keys are used, including, but not limited to, the following protocol messages for server authentication and user authentication:
ja: この文書の公開鍵アルゴリズムとエンコーディングは, サーバの認証とユーザの認証のための次のプロトコルメッセージを含む(ただし, これだけに限定されない)公開鍵が利用されるセキュアシェルプロトコルスイートの任意の場所で受け入れられる必要がある.

source: Each of these methods specifies GSS-API-authenticated Diffie-Hellman key exchange as described in Section 2.2 with SHA-1 as HASH.
ja: この種類のメソッドのそれぞれは， 2．2 節で記述した SHA-1をHASHとするGSS-APIで認証される Diffie-Hellman 鍵交換 を指定します．

source: The Secure Shell (SSH) [5] session channel provides a mechanism for the client-user to interactively enter commands and receive output from a remote host while taking advantage of the SSH transport's privacy and integrity features.
ja: セキュアシェル (SSH) [5] セッションチャンネルは, SSHのトランスポートの秘密性と完全性の特徴を利用しながら, クライアントユーザにインタラクティブにコマンドを入力しリモートホストから出力を受けるメカニズムを提供する.

source: Once the session has been established and capabilities have been exchanged, the NETCONF client will send complete XML documents containing <rpc> elements to the server, and the NETCONF server will respond with complete XML documents containing <rpc-reply> elements.
ja: セッションが確立され機能が交換されたら, NETCONF クライアントは <rpc> 要素を含む 完全な XML 文書をサーバに送る. そして NETCONF サーバは <rpc-reply> 要素を含む完全な XML 文書で応答する.

source: Conventions .........................................8 4.3.2.
ja: 規約 .........................................8 4.3.2.

source: The Secure Shell (SSH) Authentication Protocol
ja: セキュア シェル (SSH) 認証プロトコル

source: When this Textual Convention is used as a syntax of an index object, there may be issues with the limit of 128 sub-identifiers, which is specified in SMIv2 (STD 58).
ja: このテキスト表記がインデックスオブジェクトの構文として用いられる場合, SMIv2 (STD 58) で指定されている 128 のサブ識別子の制限の問題がある場合がある.

source: This will allow the server to arbitrarily select or change the underlying authentication mechanism(s) without having to update client code.
ja: これは, クライアントのコードを更新する必要なしに認証メカニズムをサーバが任意に選択/変更できるということでもある

source: The IANA considerations for the SSH protocol, as defined in [SSH-ARCH], [SSH-TRANS], [SSH-CONNECT], and this document, are detailed in [SSH-NUMBERS].
ja: [SSH-ARCH], [SSH-TRANS], [SSH-CONNECT] とこの文書で定義される SSH プロトコルに対する IANA の考慮は, [SSH-NUMBERS] で詳述されている.

source: This section describes how the Suite B components are to be used in the Secure Shell algorithm negotiation, key agreement, server authentication, and user authentication.
ja: この節は, セキュアシェルアルゴリズム交渉や, 鍵合意, サーバ認証, ユーザ認証で Suite B 構成要素がどのように用いられるかを記述する.

source: Diffie-Hellman Key Exchange
ja: Diffie-Hellman 鍵交換

source: o "Generic Security Service Application Program Interface (GSS-API) Authentication and Key Exchange for the Secure Shell (SSH) Protocol" [RFC4462] describes methods for using the GSS-API for authentication and key exchange in SSH.
ja: o "セキュア シェル (SSH) プロトコルのための汎用セキュリティサービスアプリケーションプログラムインタフェイス(GSS-API) 認証と鍵交換" [RFC4462] は, SSHで認証と鍵交換のためにGSS-APIを使う方法を記述する.

source: The format of this string is specified in Section 6.1 of [RFC5656].
ja: この文字列のフォーマットは, [RFC5656] の 6.1 節で指定されている.

source: A Transport Model is a component of the Transport Subsystem [RFC5590] within the SNMP architecture.
ja: トランスポートモデルは, SNMP アーキテクチャの中の トランスポートサブシステム [RFC5590] の構成要素だ.

source: If the peers have rekeyed, then the replay will be detected since the MAC check will fail.
ja: ピアが鍵の再作成をしているなら, MACの検査が失敗してリプレイが検知される.

source: Represents a 32-bit unsigned integer.
ja: 32-bitの符号無し整数を表す.

source: Review of Secure Shell
ja: セキュアシェルの復習

source: Implementers are encouraged to provide a default local policy and make its parameters known to administrators and users.
ja: 実装者には, デフォルトのローカルポリシーを提供しそのパラメータを管理者とユーザに知らせることが推奨される.

source: The server responds with
ja: サーバは以下で応答する:

source: snmpSshtmSessionNoSessions OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION "The number of times an outgoing message was dropped because the same session was no longer available.
ja: snmpSshtmSessionNoSessions OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION "同一のセッションがもはや利用不能のため, 送信メッセージがドロップされた回数.

source: The "serpent256-cbc" cipher in CBC mode, with a 256-bit key as described in the Serpent AES submission.
ja: "serpent256-cbc" 暗号は, CBCモードで 256-bitの鍵を用いる. Serpent AES submission.で記述されている.

source: As a result, the use of a new host key by an already-known host is usually considered an indication of a possible man-in-the-middle attack, and clients often present strong warnings and/or abort the connection in such cases.
ja: 結果として, 既知のホストが新しいホスト鍵を用いると, 通常は中間者攻撃の指標だと考えられ, クライアントはこのような場合に強い警告を出す かつ/もしくは 接続を中断する ことが多い.

source: As an example, SSH_MSG_CHANNEL_DATA is defined as follows.
ja: 例として, SSH_MSG_CHANNEL_DATA を次で定義する

source: The following MIB module imports items from [RFC2578], [RFC2579], and [RFC2580].
ja: 以下の MIB モジュールは, [RFC2578], [RFC2579], [RFC2580] から項目をインポートする.

source: Procedures for Sending an Outgoing Message ................17 5.3.
ja: 送信メッセージのための手順 ................17 5.3.

source: It should be noted that the Diffie-Hellman key exchanges may provide perfect forward secrecy (PFS).
ja: Diffie-Hellman 鍵交換は完全な前方秘密性(PFS)を提供できることを注記しておく.

source: Protocol packets containing the SSH_MSG_CHANNEL_OPEN_FAILURE message MUST have Channel Connection Failure 'reason code' values in the range of 0x00000001 to 0xFFFFFFFF.
ja: SSH_MSG_CHANNEL_OPEN_FAILURE メッセージを含むプロトコルのパケットは, 0x00000001 から 0xFFFFFFFF の範囲のチャンネル接続失敗の 'reason code' を持たなければならない.

source: However, this is not a problem if the size of the private exponent is big enough.
ja: しかし, プライベート指数が十分大きければ問題ではない.

source: Again, this depends on the context in which the list is used.
ja: さらに, 重要度はリストが用いられる前後関係に依存する.

source: All packets following the identification string SHALL use the binary packet protocol, which is described in Section 6.
ja: 識別文字列のあとのすべてのパケットは, 6節で記述する, バイナリパケットプロトコルを利用することになる.

source: Appendix A. Example
ja: Appendix A. 例

source: Public Key Subsystem Overview
ja: 公開鍵サブシステムの概要

source: The group used for Diffie-Hellman key exchange and the underlying GSS-API mechanism are also defined by the method name.
ja: Diffie-Hellman 鍵交換と基底にある GSS-API メカニズムで用いる群も, その方法の名前で定義される.

source: This value is called the exchange hash, and it is used to authenticate the key exchange as per [RFC4253].
ja: この値は交換ハッシュと呼ばれる. [RFC4253] により鍵交換を認証するのに用いられる.

source: The security considerations of [SSH-Arch] apply.
ja: [SSH-Arch]のセキュリティの考察が適用される.

source: The authentication protocol [SSH-USERAUTH] provides a suite of mechanisms that can be used to authenticate the client user to the server.
ja: 認証プロトコル [SSH-USERAUTH] は, クライアントのユーザをサーバに認証するのに利用される一連のメカニズムを提供する.

source: This method may be used only if the initial key exchange was performed using a GSS-API-based key exchange method defined in accordance with Section 2.
ja: 2 節に従って定義された GSS-API ベースの鍵交換法を用いて最初の鍵交換が行なわれた場合にのみ, この方法は利用できる.

source: The server MUST attempt to store the public key for the user in the appropriate location so the public key can be used for subsequent public key authentications.
ja: サーバは, 以降の公開鍵認証で公開鍵が利用可能になる適切な場所にユーザの公開鍵を保存しようと試みなければならない.

source: The following is a brief summary for convenience, but note well that [SSH-NUMBERS] contains the actual instructions to the IANA, which may be superseded in the future.
ja: 便宜のために簡単なまとめを次に挙げる. しかし, [SSH-NUMBERS]は, IANA への実際の指示を含んでいる. これは, 将来置き換えられるかもしれない.

source: The "arcfour256" algorithm is the same, but uses a 256-bit key.
ja: "arcfour256" アルゴリズムも同じで, ただし 256-bit の鍵を利用する.

source: The "zlib" compression is described in [RFC1950] and in [RFC1951].
ja: "zlib" 圧縮は, [RFC1950] と [RFC1951] に記述されている.

source: IANA has assigned the Connection Protocol Channel Request Name "break" in accordance with [6].
ja: IANA は, [6] に従って このコネクションプロトコルチャンネルの要求名を "break" と割り当てた.

source: The SSH ECC public key algorithm is specified by a family of public key format identifiers.
ja: SSH楕円曲線公開鍵アルゴリズムは, 公開鍵フォーマット識別子のファミリで指定される.

source: This document should be read only after reading the documents describing the SSH protocol architecture [SSH-ARCH], transport layer protocol [SSH-TRANSPORT], and user authentication protocol [SSH-USERAUTH].
ja: この文書は SSHプロトコルアーキテクチャ [SSH-ARCH], トランスポート層プロトコル [SSH-TRANSPORT], ユーザ認証プロトコル [SSH-USERAUTH] を読んでからのみ読むべきだ.

source: The format of the part preceding the at-sign is not specified; however, these names MUST be printable US-ASCII strings, and MUST NOT contain the comma character (","), whitespace, control characters (ASCII codes 32 or less), or the ASCII code 127 (DEL).
ja: アットマークの前の部分の形式は指定されていない; しかし, 表示可能な US-ASCIIの文字列で, コンマ (","), スペース, 制御文字(ASCIIコード 32以下), ASCIIコードの127 (DEL)を含んではならない.

source: When both peers implement base:1.1 capability, a proper framing protocol (chunked framing mechanism; see Section 4.2) is used for the rest of the NETCONF session, to avoid injection attacks.
ja: 両方のピアが base:1.1 機能を実装していれば, インジェクション攻撃を避けるために, 残りの NETCONF セッションでは適切なフレーミングプロトコル (チャンクされたフレーミングメカニズム; 4.2 節参照) が用いられる.

source: Once the session has been established and capabilities have been exchanged, the manager will send complete XML documents containing <rpc> elements to the server, and the agent will respond with complete XML documents containing <rpc-reply> elements.
ja: セッションが確立され機能が交換されたら, マネージャは <rpc> 要素を含む 完全な XML 文書をサーバに送る. そして エージェントは <rpc-reply> 要素を含む完全な XML 文書で応答する.

source: The numbers 60-79 are specific to user authentication and may be redefined by other user auth methods.
ja: 60-79 の範囲の数はユーザ認証特有のもので, 他の鍵交換法で再定義できる.

source: The last line of a conforming key file MUST be an end marker, which is the literal text:
ja: この文書に従う鍵ファイルの最終行は 終了マーカーでなければならない. マーカーは以下のテキストだ.

source: 39 IXANY Any char will restart after stop.
ja: 39 IXANY どの文字でもストップ後の再開を行なう.

source: As specified in [SSH-Tran], the encryption keys and initialization vectors needed by Secure Shell are derived directly from the SSV using the hash function specified by the key agreement algorithm (SHA-256 for ecdh-sha2-nistp256 and SHA-384 for ecdh-sha2-nistp384).
ja: [SSH-Tran] で指定されているように, セキュアシェルで必要な暗号化鍵と初期化ベクトルは, 鍵合意アルゴリズムで指定されたハッシュ関数 (ecdh-sha2-nistp256 では SHA-256, ecdh-sha2-nistp384 では SHA-384) を用いて SSV から直接導出される.

source: It is possible that an observer may gain valuable information simply by counting that number.
ja: この斯うを数えるだけで意味のある情報を得られる観察者がいるかもしれない.

source: Verification of the client's principal identity is important for use with the SNMP Access Control Subsystem to ensure that only authorized principals have access to potentially sensitive data.
ja: クライアントの識別情報の検証は, 認証されたもののみが機密の可能性のあるデータへのアクセスをすることを保証することはSNMP アクセス制御サブシステムの利用で重要だ.

source: Usually, the 'response specific data' is non-existent.
ja: 通常, 'response specific data' は存在しない.

source: Basic understanding of the DNS system [1][2] and the DNS security extensions [5] is assumed by this document.
ja: DNS システム [1][2] と DNS セキュリティ拡張 [5] の基本的な理解をこの文書では仮定している.
